In [4]:
import pandas as pd
df_minedu = pd.read_excel('matricula.xlsx',
                       sheet_name='Hoja01',
                       skiprows=0,
                       skipfooter=0)
df_minedu.head(5)

,DEPARTAMENTO,Total,Total-BR,Inicial-BR,Primaria-BR,Secundaria-BR,Basica-Alternativa,Basica-Especial,Tecnico-Productiva,Total-Sup,Pedagog-Sup,Tecnolog-Sup,Artistica-Sup
0,Moquegua,50453,42994,10381,18436,14177,1528,204,2760,2967,416,2551,0
1,Madre de Dios,55109,51056,11450,24866,14740,2036,58,607,1352,307,1045,0
2,Tumbes,78212,68088,18258,30206,19624,3006,355,3354,3409,537,2872,0
3,Pasco,81714,73455,16923,34014,22518,2273,190,2725,3071,611,2460,0
4,Tacna,94602,82238,18780,35799,27659,2150,217,4271,5726,820,4584,322

In [5]:
import pandas as pd
df_minedu = pd.read_excel('matricula.xlsx',
                       sheet_name='Hoja01',
                       skiprows=0,
                       skipfooter=0)
df_minedu.tail(5)

,DEPARTAMENTO,Total,Total-BR,Inicial-BR,Primaria-BR,Secundaria-BR,Basica-Alternativa,Basica-Especial,Tecnico-Productiva,Total-Sup,Pedagog-Sup,Tecnolog-Sup,Artistica-Sup
21,Cajamarca,440557,405713,88516,185757,131440,8839,405,5190,20410,5612,14242,556
22,La Libertad,534177,489449,106732,229117,153600,10600,1033,14666,18429,3571,14294,564
23,Piura,585433,546568,122684,254347,169537,10076,821,11637,16331,1015,15316,0
24,Lima,2725645,2303400,520383,1028626,754391,69804,8925,96385,247131,8137,238753,241
25,Total,9038947,8024672,1768758,3667092,2588822,215176,20722,252049,526328,52225,467826,6277

In [6]:
import pandas as pd
df_minedu = pd.read_excel('matricula.xlsx',
                       sheet_name='Hoja01',
                       skiprows=0,
                       skipfooter=0)
df_minedu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   DEPARTAMENTO        26 non-null     object
 1   Total               26 non-null     int64
 2   Total-BR            26 non-null     int64
 3   Inicial-BR          26 non-null     int64
 4   Primaria-BR         26 non-null     int64
 5   Secundaria-BR       26 non-null     int64
 6   Basica-Alternativa  26 non-null     int64
 7   Basica-Especial     26 non-null     int64
 8   Tecnico-Productiva  26 non-null     int64
 9   Total-Sup           26 non-null     int64
 10  Pedagog-Sup         26 non-null     int64
 11  Tecnolog-Sup        26 non-null     int64
 12  Artistica-Sup       26 non-null     int64
dtypes: int64(12), object(1)
memory usage: 2.8+ KB

In [7]:
import pandas as pd
df_minedu = pd.read_excel('matricula.xlsx',
                       sheet_name='Hoja01',
                       skiprows=0,
                       skipfooter=0)
df_minedu.columns.values

array(['DEPARTAMENTO', 'Total', 'Total-BR', 'Inicial-BR', 'Primaria-BR',
       'Secundaria-BR', 'Basica-Alternativa', 'Basica-Especial',
       'Tecnico-Productiva', 'Total-Sup', 'Pedagog-Sup', 'Tecnolog-Sup',
       'Artistica-Sup'], dtype=object)

In [8]:
import pandas as pd
df_minedu = pd.read_excel('matricula.xlsx',
                       sheet_name='Hoja01',
                       skiprows=0,
                       skipfooter=0)
df_minedu.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25], dtype=int64)

In [3]:
import pandas as pd
df_minedu = pd.read_excel('matricula.xlsx',
                       sheet_name='Hoja01',
                       skiprows=0,
                       skipfooter=0)
print(type(df_minedu.columns))
print(type(df_minedu.index))

<class 'pandas.core.indexes.base.Index'>
<class 'pandas.core.indexes.range.RangeIndex'>

In [4]:
df_minedu.columns.tolist()
df_minedu.index.tolist()

print (type(df_minedu.columns.tolist()))
print (type(df_minedu.index.tolist()))

<class 'list'>
<class 'list'>

In [5]:
df_minedu.shape

(26, 13)

In [6]:
df_minedu.drop(['Basica-Alternativa','Basica-Especial','Tecnico-Productiva'], axis=1, inplace=True)
df_minedu.head(2)

,DEPARTAMENTO,Total,Total-BR,Inicial-BR,Primaria-BR,Secundaria-BR,Total-Sup,Pedagog-Sup,Tecnolog-Sup,Artistica-Sup
0,Moquegua,50453,42994,10381,18436,14177,2967,416,2551,0
1,Madre de Dios,55109,51056,11450,24866,14740,1352,307,1045,0

In [7]:
df_minedu.rename(columns={'Total-Sup':'Total-NoSup', 'Pedagog-Sup':'Pedag-NoSup', 'Tecnolog-Sup':'Tecno-NoSup', 'Artistica-Sup':'Art-NoSup'}, inplace=True)
df_minedu.columns

Index(['DEPARTAMENTO', 'Total', 'Total-BR', 'Inicial-BR', 'Primaria-BR',
       'Secundaria-BR', 'Total-NoSup', 'Pedag-NoSup', 'Tecno-NoSup',
       'Art-NoSup'],
      dtype='object')